---
kind: type
id: T:Autodesk.Revit.Exceptions.NetworkCommunicationException
source: html/77e5da6e-c129-8e56-c944-26d2c5e925a3.htm
---
# Autodesk.Revit.Exceptions.NetworkCommunicationException

## Syntax (C#)
```csharp
[SerializableAttribute]
public class NetworkCommunicationException : ApplicationException
```